<a href="https://colab.research.google.com/github/Ahmed-Essam-Abdullah/Pandas/blob/main/Pandas_Questions.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# üêº Pandas Practice: DataFrames, Selection, Mapping, and More

In [17]:
import pandas as pd
import numpy as np

# Set seed for reproducibility
np.random.seed(42)

# Sample data
names = ['Alice', 'Bob', 'Charlie', 'Diana', 'Ethan', 'Fiona', 'George', 'Hannah']
departments = ['Sales', 'Marketing', 'HR', 'Tech']

# Create a DataFrame
df = pd.DataFrame({
    'Name': np.random.choice(names, size=20),
    'Age': np.random.randint(22, 60, size=20),
    'Department': np.random.choice(departments, size=20),
    'Salary': np.random.randint(40000, 120000, size=20),
    'YearsExperience': np.random.randint(0, 20, size=20)
})
df.head()

      Name  Age Department  Salary  YearsExperience
0   George   43         HR   75920               15
1    Diana   23  Marketing  107121               12
2    Ethan   45       Tech  109479               17
3   George   51      Sales   59457               14
4  Charlie   59       Tech  106557               12

# üß™ PRACTICE QUESTIONS BELOW


# 1Ô∏è‚É£ Use .loc to select all rows where the Department is 'Tech'.
#    - Describe what .loc does and why it's useful for label-based filtering.

In [18]:
# Explanation:-
# .loc is used for label selection in Pandas, as it filters rows based on our conditions.
# We use it to see a specific type of data according to the condition we decide
# in this example we select all rows where Department is 'Tech'.

# Code:
tech_employees = df.loc[df['Department'] == 'Tech']
print(tech_employees)

       Name  Age Department  Salary  YearsExperience
2     Ethan   45       Tech  109479               17
4   Charlie   59       Tech  106557               12
12  Charlie   49       Tech  111211               11
13  Charlie   37       Tech  105697                7
15    Ethan   24       Tech   72606               18
17   Hannah   28       Tech   80397                7
19  Charlie   30       Tech   95591                2


# 2Ô∏è‚É£ Use .iloc to select the first 5 rows and the last two columns.
#    - What is the difference between .loc and .iloc?

In [19]:
# Explanation:-
# .loc is label based selection, as it selects rows and columns using their (names).
# .iloc is position based selection, as it selects rows and columns using (index numbers).

# Code:
x = df.iloc[0:5,-2:]
print(x)

   Salary  YearsExperience
0   75920               15
1  107121               12
2  109479               17
3   59457               14
4  106557               12


# 3Ô∏è‚É£ Map a new column called 'DeptCode' where:
#     'Sales' -> 1, 'Marketing' -> 2, 'HR' -> 3, 'Tech' -> 4.
#    - Use .map and explain what happens if a value is not mapped.

In [49]:
# Explanation:
# .map() is used to map each value in the 'Department' column to a corresponding code based on a dictionary.
# If a value in 'Department' does NOT exist in the mapping dictionary, the result will be NaN.
# This happens because .map() will return NaN for unmapped values.

# Code:
dept_mapping = {
    'Sales': 1, 'Marketing': 2, 'HR': 3, 'Tech': 4
}
df['DeptCode'] = df['Department'].map(dept_mapping)
print(df[['Department', 'DeptCode']])

   Department  DeptCode
0          HR         3
1   Marketing         2
2        Tech         4
3       Sales         1
4        Tech         4
5   Marketing         2
6   Marketing         2
7   Marketing         2
8       Sales         1
9   Marketing         2
10      Sales         1
11  Marketing         2
12       Tech         4
13       Tech         4
14         HR         3
15       Tech         4
16         HR         3
17       Tech         4
18      Sales         1
19       Tech         4


# 4Ô∏è‚É£ Use .apply to calculate a new column 'Seniority' where:
#     - If YearsExperience > 10 ‚Üí 'Senior'
#     - If between 5-10 ‚Üí 'Mid-Level'
#     - Else ‚Üí 'Junior'
#    - Use a lambda function with apply.

In [20]:
# Code:
df['Seniority'] = df['YearsExperience'].apply(
    lambda x: 'Senior' if x > 10 else ('Mid-Level' if x >= 5 else 'Junior')
)
print(df[['YearsExperience', 'Seniority']])

    YearsExperience  Seniority
0                15     Senior
1                12     Senior
2                17     Senior
3                14     Senior
4                12     Senior
5                 8  Mid-Level
6                14     Senior
7                12     Senior
8                 0     Junior
9                 6  Mid-Level
10                8  Mid-Level
11                0     Junior
12               11     Senior
13                7  Mid-Level
14               10  Mid-Level
15               18     Senior
16               16     Senior
17                7  Mid-Level
18                2     Junior
19                2     Junior


# 5Ô∏è‚É£ Overwrite all salaries for employees with < 3 years of experience to 35000.
#    - Use boolean indexing with .loc to do this.

In [22]:
df.loc[df['YearsExperience'] < 3, 'Salary'] = 35000
print(df[['YearsExperience', 'Salary']])

    YearsExperience  Salary
0                15   75920
1                12  107121
2                17  109479
3                14   59457
4                12  106557
5                 8  117189
6                14  118953
7                12   92995
8                 0   35000
9                 6   49692
10                8   85758
11                0   35000
12               11  111211
13                7  105697
14               10   77065
15               18   72606
16               16   51534
17                7   80397
18                2   35000
19                2   35000


# 6Ô∏è‚É£ Compare using .loc and .iloc to select the same row:
#    - Select the 3rd row using .iloc
#    - Find its index value and use .loc to select the same row by label

In [24]:
# Code:
third_row = df.iloc[2]
print("using iloc:\n", third_row)

row_index = df.index[2]
thirdRowLoc = df.loc[row_index]
print("\nusing loc:\n", thirdRowLoc)

using iloc:
 Name                Ethan
Age                    45
Department           Tech
Salary             109479
YearsExperience        17
Seniority          Senior
Name: 2, dtype: object

using loc:
 Name                Ethan
Age                    45
Department           Tech
Salary             109479
YearsExperience        17
Seniority          Senior
Name: 2, dtype: object


# 7Ô∏è‚É£ Check if there are any duplicate names in the dataset.
#    - If there are, show only those duplicated rows.

In [25]:
# Code:
duplicates= df[df.duplicated(subset='Name', keep=False)]
print("Duplicated rows':\n", duplicates)

Duplicated rows':
        Name  Age Department  Salary  YearsExperience  Seniority
0    George   43         HR   75920               15     Senior
1     Diana   23  Marketing  107121               12     Senior
2     Ethan   45       Tech  109479               17     Senior
3    George   51      Sales   59457               14     Senior
4   Charlie   59       Tech  106557               12     Senior
5    Hannah   23  Marketing  117189                8  Mid-Level
6     Ethan   42  Marketing  118953               14     Senior
7     Ethan   54  Marketing   92995               12     Senior
8    George   33      Sales   35000                0     Junior
10  Charlie   46      Sales   85758                8  Mid-Level
11   George   48  Marketing   35000                0     Junior
12  Charlie   49       Tech  111211               11     Senior
13  Charlie   37       Tech  105697                7  Mid-Level
14   Hannah   36         HR   77065               10  Mid-Level
15    Ethan   24       Tech   72606               18     Senior
16    Diana   58         HR   51534               16     Senior
17   Hannah   28       Tech   80397                7  Mid-Level
18   Hannah   42      Sales   35000                2     Junior
19  Charlie   30       Tech   35000                2     Junior


# 8Ô∏è‚É£ Sort the DataFrame by Salary in descending order.
#    - Then sort it by Department and within Department by Age.

In [26]:
# Code:
# Sort by Salary descending
sorted_salary = df.sort_values(by='Salary', ascending=False)
print("Sorted by Salary:\n",sorted_salary[['Name', 'Department', 'Salary']])

# Sort by Department, then Age
sorted_dept_age = df.sort_values(by=['Department', 'Age'])
print("\nSorted by Department and Age:\n",sorted_dept_age[['Name', 'Department', 'Age']])

Sorted by Salary:
        Name Department  Salary
6     Ethan  Marketing  118953
5    Hannah  Marketing  117189
12  Charlie       Tech  111211
2     Ethan       Tech  109479
1     Diana  Marketing  107121
4   Charlie       Tech  106557
13  Charlie       Tech  105697
7     Ethan  Marketing   92995
10  Charlie      Sales   85758
17   Hannah       Tech   80397
14   Hannah         HR   77065
0    George         HR   75920
15    Ethan       Tech   72606
3    George      Sales   59457
16    Diana         HR   51534
9       Bob  Marketing   49692
11   George  Marketing   35000
8    George      Sales   35000
18   Hannah      Sales   35000
19  Charlie       Tech   35000

Sorted by Department and Age:
        Name Department  Age
14   Hannah         HR   36
0    George         HR   43
16    Diana         HR   58
1     Diana  Marketing   23
5    Hannah  Marketing   23
6     Ethan  Marketing   42
9       Bob  Marketing   43
11   George  Marketing   48
7     Ethan  Marketing   54
8    George      Sales   33
18   Hannah      Sales   42
10  Charlie      Sales   46
3    George      Sales   51
15    Ethan       Tech   24
17   Hannah       Tech   28
19  Charlie       Tech   30
13  Charlie       Tech   37
2     Ethan       Tech   45
12  Charlie       Tech   49
4   Charlie       Tech   59


# 9Ô∏è‚É£ Slice the DataFrame to return rows 5 through 12 and columns 'Name', 'Salary'
#    - Try slicing using both label-based and position-based methods.

In [27]:
# Code:
# label-based
sliced_loc = df.loc[5:12, ['Name', 'Salary']]
print("\nSlicing with loc:\n", sliced_loc)

# position-based
sliced_iloc = df.iloc[5:13, [0, 3]]
print("Slicing with iloc:\n", sliced_iloc)

Slicing with loc:
        Name  Salary
5    Hannah  117189
6     Ethan  118953
7     Ethan   92995
8    George   35000
9       Bob   49692
10  Charlie   85758
11   George   35000
12  Charlie  111211
Slicing with iloc:
        Name  Salary
5    Hannah  117189
6     Ethan  118953
7     Ethan   92995
8    George   35000
9       Bob   49692
10  Charlie   85758
11   George   35000
12  Charlie  111211


# üîü Find all rows where the name starts with 'A' or 'D'.
#    - Use string methods with .str accessor.

In [28]:
# Code:
names = df.loc[df['Name'].str.startswith(('A', 'D'))]
print("Names starting with A or D:\n",names[['Name', 'Department']])

Names starting with A or D:
      Name Department
1   Diana  Marketing
16  Diana         HR


# 1Ô∏è‚É£1Ô∏è‚É£ Drop all rows where Age is below 25.
#     - Explain whether this modifies the DataFrame in place or returns a copy.

In [33]:
# Explanation:-
# This operation returns a new DataFrame (copy) and does not modify df in place.
# To modify it in it's place we will need to use "inplace=True with drop().
# Code:
age = df[df['Age'] >= 25]
print("After dropping Age < 25:\n",age)

After dropping Age < 25:
        Name  Age Department  Salary  YearsExperience  Seniority
0    George   43         HR   75920               15     Senior
2     Ethan   45       Tech  109479               17     Senior
3    George   51      Sales   59457               14     Senior
4   Charlie   59       Tech  106557               12     Senior
6     Ethan   42  Marketing  118953               14     Senior
7     Ethan   54  Marketing   92995               12     Senior
8    George   33      Sales   35000                0     Junior
9       Bob   43  Marketing   49692                6  Mid-Level
10  Charlie   46      Sales   85758                8  Mid-Level
11   George   48  Marketing   35000                0     Junior
12  Charlie   49       Tech  111211               11     Senior
13  Charlie   37       Tech  105697                7  Mid-Level
14   Hannah   36         HR   77065               10  Mid-Level
16    Diana   58         HR   51534               16     Senior
17   Hannah   28       Tech   80397                7  Mid-Level
18   Hannah   42      Sales   35000                2     Junior
19  Charlie   30       Tech   35000                2     Junior


# 1Ô∏è‚É£2Ô∏è‚É£ Use groupby to calculate the average salary per Department.
#     - Bonus: Show the average age and average experience too.

In [37]:
# Group by Department and calculate our averages

#.agg() let is do multiple aggregation operations on different columns at once

department_averages = df.groupby('Department').agg({
    'Salary':'mean', 'Age': 'mean', 'YearsExperience': 'mean' })

print("Average Salary, Age, and Experience per Department:\n\n", department_averages)

Average Salary, Age, and Experience per Department:

                   Salary        Age  YearsExperience
Department
HR          68173.000000  45.666667        13.666667
Marketing   86825.000000  38.833333         8.666667
Sales       53803.750000  43.000000         6.000000
Tech        88706.714286  38.857143        10.571429


# 1Ô∏è‚É£3Ô∏è‚É£ Use groupby to count how many employees are in each Department.

In [38]:
# Alternatively using groupby:
count = df.groupby('Department').size()
print("\nNumber of employee in each Department:\n",count)

Number of employee in each Department:
 Department
HR           3
Marketing    6
Sales        4
Tech         7
dtype: int64


# 1Ô∏è‚É£4Ô∏è‚É£ Use .apply to normalize the Salary column (min-max scaling between 0 and 1).
#     - Bonus: Write your own normalization function and pass it to apply.

In [40]:
#code:
def minMaxNormalize(x,min,max):
    return (x-min)/(max-min)

min_salary= df['Salary'].min()
max_salary= df['Salary'].max()

df['NormalizedSalary'] = df['Salary'].apply(lambda x: minMaxNormalize(x,min_salary,max_salary))
print(df[['Salary', 'NormalizedSalary']])

    Salary  NormalizedSalary
0    75920          0.487416
1   107121          0.859064
2   109479          0.887151
3    59457          0.291318
4   106557          0.852346
5   117189          0.978988
6   118953          1.000000
7    92995          0.690803
8    35000          0.000000
9    49692          0.175003
10   85758          0.604600
11   35000          0.000000
12  111211          0.907782
13  105697          0.842102
14   77065          0.501054
15   72606          0.447941
16   51534          0.196944
17   80397          0.540743
18   35000          0.000000
19   35000          0.000000


# 1Ô∏è‚É£5Ô∏è‚É£ Use boolean indexing to find all employees who:
#     - Are in 'HR' OR 'Tech', AND have > 5 years of experience.

# üîÅ For many of these tasks, try both .loc and .iloc to build intuition on their differences.

In [48]:
employees = df.loc[
    ((df['Department'] == 'HR') | (df['Department'] == 'Tech')) &
    (df['YearsExperience'] > 5) ]
print("Employees in HR or Tech with more than 5 years experience:\n", employees)

# Getting positions of Department and YearsExperience by columns
dept_idx = df.columns.get_loc('Department')
exp_idx = df.columns.get_loc('YearsExperience')

# Use iloc for filtering
#mask is a Boolean Series that marks rows where:-
#Department is (HR or Tech)
#YearsExperience is greater than 5
#mask[mask] Filters only True rows
#.index.tolist() Extracts their index labels as a list

mask = ((df.iloc[:, dept_idx] == 'HR') | (df.iloc[:, dept_idx] == 'Tech')) & (df.iloc[:, exp_idx] > 5)
positions = mask[mask].index.tolist()

filtered= df.iloc[positions]
print("Filtered using iloc:\n", filtered)

Employees in HR or Tech with more than 5 years experience:
        Name  Age Department  Salary  YearsExperience  Seniority  \
0    George   43         HR   75920               15     Senior
2     Ethan   45       Tech  109479               17     Senior
4   Charlie   59       Tech  106557               12     Senior
12  Charlie   49       Tech  111211               11     Senior
13  Charlie   37       Tech  105697                7  Mid-Level
14   Hannah   36         HR   77065               10  Mid-Level
15    Ethan   24       Tech   72606               18     Senior
16    Diana   58         HR   51534               16     Senior
17   Hannah   28       Tech   80397                7  Mid-Level

    NormalizedSalary
0           0.487416
2           0.887151
4           0.852346
12          0.907782
13          0.842102
14          0.501054
15          0.447941
16          0.196944
17          0.540743
Filtered using iloc:
        Name  Age Department  Salary  YearsExperience  Seniority  \
0    George   43         HR   75920               15     Senior
2     Ethan   45       Tech  109479               17     Senior
4   Charlie   59       Tech  106557               12     Senior
12  Charlie   49       Tech  111211               11     Senior
13  Charlie   37       Tech  105697                7  Mid-Level
14   Hannah   36         HR   77065               10  Mid-Level
15    Ethan   24       Tech   72606               18     Senior
16    Diana   58         HR   51534               16     Senior
17   Hannah   28       Tech   80397                7  Mid-Level

    NormalizedSalary
0           0.487416
2           0.887151
4           0.852346
12          0.907782
13          0.842102
14          0.501054
15          0.447941
16          0.196944
17          0.540743